In [22]:
import pandas as pd

In [23]:
df = pd.DataFrame({
    "nome" : ["kauan","kauan", "kauan", "rodrigo", "felipe", "paulo", "joão", "felipe"],
    "sobrenome" : ["amorim", "amorim", "carlos", "moreira", "dos anjos", "pereira", "moreira", "dos anjos"],
    "salário" : [6456, 3456, 2432 , 986, 1223, 5654, 10234, 1223]
})

In [24]:
df

      nome  sobrenome  salário
0    kauan     amorim     6456
1    kauan     amorim     3456
2    kauan     carlos     2432
3  rodrigo    moreira      986
4   felipe  dos anjos     1223
5    paulo    pereira     5654
6     joão    moreira    10234
7   felipe  dos anjos     1223

In [25]:
#remove as duplicatas e mantem a primeira

df.drop_duplicates(keep='first')

      nome  sobrenome  salário
0    kauan     amorim     6456
1    kauan     amorim     3456
2    kauan     carlos     2432
3  rodrigo    moreira      986
4   felipe  dos anjos     1223
5    paulo    pereira     5654
6     joão    moreira    10234

In [26]:
df.drop_duplicates(subset=["nome", "sobrenome"])

      nome  sobrenome  salário
0    kauan     amorim     6456
2    kauan     carlos     2432
3  rodrigo    moreira      986
4   felipe  dos anjos     1223
5    paulo    pereira     5654
6     joão    moreira    10234

In [29]:
df.sort_values(["salário"], ascending=False).drop_duplicates(subset=["nome", "sobrenome"])

      nome  sobrenome  salário
6     joão    moreira    10234
0    kauan     amorim     6456
5    paulo    pereira     5654
2    kauan     carlos     2432
4   felipe  dos anjos     1223
3  rodrigo    moreira      986